Curve and Surface do not intersect.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CurveAndSurfaceDoNotIntersect { get; }
  Visual Basic
Public Shared ReadOnly Property CurveAndSurfaceDoNotIntersect As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CurveAndSurfaceDoNotIntersect {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeometryFailures Class
  Autodesk.Revit.DB Namespace